Тест_ЗУП_31_КОРП/src/Catalogs/КомплектыОтчетностиПерсучета/КомплектыОтчетностиПерсучета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КомплектыОтчетностиПерсучета</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетныйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодФормирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКомплекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеКомплекта</name>
    <type>
      <types>EnumRef.СостояниеКомплектаОтчетностиПерсучета</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписьПачекСЗВ</name>
    <type>
      <types>DocumentRef.ОписьПачекСЗВ_6</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедомостьУплатыАДВ11</name>
    <type>
      <types>DocumentRef.ВедомостьУплатыАДВ_11</types>
    </type>
  </attributes>
  <attributes>
    <name>РСВ_1</name>
    <type>
      <types>DocumentRef.РегламентированныйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресФайлаВыгрузкиРСВ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВыгрузкиРСВ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НулевойКомплект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставКомплектаПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректирующаяФормаРСВ_1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитТолькоКорректирующиеФормы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециальныйДокумент2015года</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПачекСЗВ</name>
    <attributes>
      <name>ПачкаДокументов</name>
      <type>
        <types>DocumentRef.ПачкаДокументовСЗВ_6_4</types>
        <types>DocumentRef.ПачкаДокументовСЗВ_6_1</types>
        <types>DocumentRef.РеестрСЗВ_6_2</types>
        <types>DocumentRef.ПачкаРазделов6РасчетаРСВ_1</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПачекСЗВ6_3</name>
    <attributes>
      <name>ПачкаДокументов</name>
      <type>
        <types>DocumentRef.ПачкаДокументовСЗВ_6_3</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КорректируемыеПериоды</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантФормирования</name>
      <type>
        <types>EnumRef.ВариантыФормированияКорректирующихСведенийВПФР</types>
      </type>
    </attributes>
    <attributes>
      <name>НулевойКомплектСведений</name>
      <type>
        <types>CatalogRef.КомплектыОтчетностиПерсучета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/CommonModules/ПерсонифицированныйУчетВызовСервера/Module.bsl
////////////////////////////////////////////////////////////////////////////////
//
//   Подсистема персонифицированного учета - вызов серверных функций с клиента.
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция КомплектСодержащийРСВ_1(РСВ_1) Экспорт
	Возврат Справочники.КомплектыОтчетностиПерсучета.КомплектСодержащийРСВ_1(РСВ_1);
КонецФункции	
	
Функция ОписаниеАктивногоКомплектаПериода(Организация, ОтчетныйПериод) Экспорт
	Возврат Справочники.КомплектыОтчетностиПерсучета.ОписаниеАктивногоКомплектаПериода(Организация, ОтчетныйПериод, Ложь);	
КонецФункции

Функция КатегорииЗастрахованныхЛицОрганизации(Организация, ОтчетныйПериод, КорректирующиеСведения = Ложь) Экспорт
	Возврат ПерсонифицированныйУчет.КатегорииЗастрахованныхЛицОрганизации(Организация, ОтчетныйПериод, ,КорректирующиеСведения);	
КонецФункции

Функция ПолучитьДанныеФайла(Ссылка, УникальныйИдентификатор) Экспорт	
	Возврат ЗарплатаКадры.ПолучитьДанныеФайла(Ссылка, УникальныйИдентификатор);	
КонецФункции

#КонецОбласти
